run/porousPimpleFoam/TESDischargeWithPerturbation2D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
//    volScalarFieldValue alpha.water 0
//    volScalarFieldValue porosity 1
);

regions
(
/*
    boxToCell
    {
        box (0 0 -1) (0.281 0.24 1);

        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    boxToCell
    {
        box (0.281 0 -1) (0.892 0.022 1);

        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
*/
    boxToCell
    {
//        box (0.30 .2 -1) (0.59 0.4 1);
        box (0.2 .2 -1) (0.3 .3 1);

        fieldValues
        (
//            volScalarFieldValue porosity 0.49
            volScalarFieldValue Ts 300
            volScalarFieldValue Tf 300
        );
    }
);


// ************************************************************************* //
